{"modelTopology":{"class_name":"Model","config":{"name":"model_1","layers":[{"name":"crepe_input","class_name":"InputLayer","config":{"batch_input_shape":[null,1024],"dtype":"float32","sparse":false,"name":"crepe_input"},"inbound_nodes":[]},{"name":"crepe_input_reshape","class_name":"Reshape","config":{"target_shape":[1024,1,1],"name":"crepe_input_reshape","trainable":true},"inbound_nodes":[[["crepe_input",0,0,{}]]]},{"name":"crepe_conv1","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[512,1],"strides":[4,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"crepe_conv1","trainable":true},"inbound_nodes":[[["crepe_input_reshape",0,0,{}]]]},{"name":"crepe_conv1_BN","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"crepe_conv1_BN","trainable":true},"inbound_nodes":[[["crepe_conv1",0,0,{}]]]},{"name":"crepe_conv1_maxpool","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"crepe_conv1_maxpool","trainable":true},"inbound_nodes":[[["crepe_conv1_BN",0,0,{}]]]},{"name":"crepe_conv1_dropout","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"crepe_conv1_dropout","trainable":true},"inbound_nodes":[[["crepe_conv1_maxpool",0,0,{}]]]},{"name":"crepe_conv2","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"crepe_conv2","trainable":true},"inbound_nodes":[[["crepe_conv1_dropout",0,0,{}]]]},{"name":"crepe_conv2_BN","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"crepe_conv2_BN","trainable":true},"inbound_nodes":[[["crepe_conv2",0,0,{}]]]},{"name":"crepe_conv2_maxpool","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"crepe_conv2_maxpool","trainable":true},"inbound_nodes":[[["crepe_conv2_BN",0,0,{}]]]},{"name":"crepe_conv2_dropout","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"crepe_conv2_dropout","trainable":true},"inbound_nodes":[[["crepe_conv2_maxpool",0,0,{}]]]},{"name":"crepe_conv3","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"crepe_conv3","trainable":true},"inbound_nodes":[[["crepe_conv2_dropout",0,0,{}]]]},{"name":"crepe_conv3_BN","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"crepe_conv3_BN","trainable":true},"inbound_nodes":[[["crepe_conv3",0,0,{}]]]},{"name":"crepe_conv3_maxpool","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"crepe_conv3_maxpool","trainable":true},"inbound_nodes":[[["crepe_conv3_BN",0,0,{}]]]},{"name":"crepe_conv3_dropout","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"crepe_conv3_dropout","trainable":true},"inbound_nodes":[[["crepe_conv3_maxpool",0,0,{}]]]},{"name":"crepe_conv4","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"crepe_conv4","trainable":true},"inbound_nodes":[[["crepe_conv3_dropout",0,0,{}]]]},{"name":"crepe_conv4_BN","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"crepe_conv4_BN","trainable":true},"inbound_nodes":[[["crepe_conv4",0,0,{}]]]},{"name":"crepe_conv4_maxpool","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"crepe_conv4_maxpool","trainable":true},"inbound_nodes":[[["crepe_conv4_BN",0,0,{}]]]},{"name":"crepe_conv4_dropout","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"crepe_conv4_dropout","trainable":true},"inbound_nodes":[[["crepe_conv4_maxpool",0,0,{}]]]},{"name":"crepe_conv5","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"crepe_conv5","trainable":true},"inbound_nodes":[[["crepe_conv4_dropout",0,0,{}]]]},{"name":"crepe_conv5_BN","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"crepe_conv5_BN","trainable":true},"inbound_nodes":[[["crepe_conv5",0,0,{}]]]},{"name":"crepe_conv5_maxpool","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"crepe_conv5_maxpool","trainable":true},"inbound_nodes":[[["crepe_conv5_BN",0,0,{}]]]},{"name":"crepe_conv5_dropout","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"crepe_conv5_dropout","trainable":true},"inbound_nodes":[[["crepe_conv5_maxpool",0,0,{}]]]},{"name":"crepe_conv6","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[64,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"crepe_conv6","trainable":true},"inbound_nodes":[[["crepe_conv5_dropout",0,0,{}]]]},{"name":"crepe_conv6_BN","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"crepe_conv6_BN","trainable":true},"inbound_nodes":[[["crepe_conv6",0,0,{}]]]},{"name":"crepe_conv6_maxpool","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"crepe_conv6_maxpool","trainable":true},"inbound_nodes":[[["crepe_conv6_BN",0,0,{}]]]},{"name":"crepe_conv6_dropout","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"crepe_conv6_dropout","trainable":true},"inbound_nodes":[[["crepe_conv6_maxpool",0,0,{}]]]},{"name":"crepe_flatten","class_name":"Flatten","config":{"name":"crepe_flatten","trainable":true},"inbound_nodes":[[["crepe_conv6_dropout",0,0,{}]]]},{"name":"crepe_classifier","class_name":"Dense","config":{"units":360,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"crepe_classifier","trainable":true},"inbound_nodes":[[["crepe_flatten",0,0,{}]]]}],"input_layers":[["crepe_input",0,0]],"output_layers":[["crepe_classifier",0,0]]},"keras_version":"tfjs-layers 3.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"crepe_conv1/kernel","shape":[512,1,1,128],"dtype":"float32"},{"name":"crepe_conv1/bias","shape":[128],"dtype":"float32"},{"name":"crepe_conv1_BN/gamma","shape":[128],"dtype":"float32"},{"name":"crepe_conv1_BN/beta","shape":[128],"dtype":"float32"},{"name":"crepe_conv2/kernel","shape":[64,1,128,16],"dtype":"float32"},{"name":"crepe_conv2/bias","shape":[16],"dtype":"float32"},{"name":"crepe_conv2_BN/gamma","shape":[16],"dtype":"float32"},{"name":"crepe_conv2_BN/beta","shape":[16],"dtype":"float32"},{"name":"crepe_conv3/kernel","shape":[64,1,16,16],"dtype":"float32"},{"name":"crepe_conv3/bias","shape":[16],"dtype":"float32"},{"name":"crepe_conv3_BN/gamma","shape":[16],"dtype":"float32"},{"name":"crepe_conv3_BN/beta","shape":[16],"dtype":"float32"},{"name":"crepe_conv4/kernel","shape":[64,1,16,16],"dtype":"float32"},{"name":"crepe_conv4/bias","shape":[16],"dtype":"float32"},{"name":"crepe_conv4_BN/gamma","shape":[16],"dtype":"float32"},{"name":"crepe_conv4_BN/beta","shape":[16],"dtype":"float32"},{"name":"crepe_conv5/kernel","shape":[64,1,16,32],"dtype":"float32"},{"name":"crepe_conv5/bias","shape":[32],"dtype":"float32"},{"name":"crepe_conv5_BN/gamma","shape":[32],"dtype":"float32"},{"name":"crepe_conv5_BN/beta","shape":[32],"dtype":"float32"},{"name":"crepe_conv6/kernel","shape":[64,1,32,64],"dtype":"float32"},{"name":"crepe_conv6/bias","shape":[64],"dtype":"float32"},{"name":"crepe_conv6_BN/gamma","shape":[64],"dtype":"float32"},{"name":"crepe_conv6_BN/beta","shape":[64],"dtype":"float32"},{"name":"crepe_classifier/kernel","shape":[256,360],"dtype":"float32"},{"name":"crepe_classifier/bias","shape":[360],"dtype":"float32"},{"name":"crepe_conv1_BN/moving_mean","shape":[128],"dtype":"float32"},{"name":"crepe_conv1_BN/moving_variance","shape":[128],"dtype":"float32"},{"name":"crepe_conv2_BN/moving_mean","shape":[16],"dtype":"float32"},{"name":"crepe_conv2_BN/moving_variance","shape":[16],"dtype":"float32"},{"name":"crepe_conv3_BN/moving_mean","shape":[16],"dtype":"float32"},{"name":"crepe_conv3_BN/moving_variance","shape":[16],"dtype":"float32"},{"name":"crepe_conv4_BN/moving_mean","shape":[16],"dtype":"float32"},{"name":"crepe_conv4_BN/moving_variance","shape":[16],"dtype":"float32"},{"name":"crepe_conv5_BN/moving_mean","shape":[32],"dtype":"float32"},{"name":"crepe_conv5_BN/moving_variance","shape":[32],"dtype":"float32"},{"name":"crepe_conv6_BN/moving_mean","shape":[64],"dtype":"float32"},{"name":"crepe_conv6_BN/moving_variance","shape":[64],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.20.0","convertedBy":null}